Hey @pranit-hashi 👋 Thank you for taking the time to raise this! I took some time to reproduce this using the configuration you provided, and have some additional information and questions.

The first question pertains to where you're seeing the retained deployment information in the console. Based on my testing, I'm assuming that you're seeing that under "Stages" once you've selected the stage created by the Terraform configuration -- is that correct?

The rest of this will assume that the answer to the above question is "yes", since that's my assumption based on my testing.

There appears to be a couple of overlapping things here that explain the behavior you're seeing. The first of which is that when you click the "Deploy API" button in the AWS Console, you're creating a new deployment of the API -- the same thing that the `aws_api_gateway_deployment` resource is doing during resource creation. The stage is then updated to point at new deployment, rather than the old one (that was created by Terraform), leaving the old one intact. The difference here is that in Terraform, when you update the value of `local.deployment_trigger_value`, the `aws_api_gateway_deployment` resource will be recreated. That is, the original deployment is destroyed, a new one is created, and the stage is updated to point at the new deployment. This can be seen in the run logs here:

```console
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.bug_test_deploy must be replaced
+/- resource "aws_api_gateway_deployment" "bug_test_deploy" {
      ~ created_date  = "2025-05-19T22:10:31Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:588738609719:85q6cfx8d8/" -> (known after apply)
      ~ id            = "c5k6dz" -> (known after apply)
      ~ invoke_url    = "https://85q6cfx8d8.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "f80ba9cb3bcabdd07a96a46d114b85847c4b9645" -> "724ee6d1f6164e57753ca95d6129ef874afc54f0"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_stage.bug_test_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "bug_test_stage" {
      ~ deployment_id         = "c5k6dz" -> (known after apply)
        id                    = "ags-85q6cfx8d8-test"
        tags                  = {}
        # (14 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

Notably, when you click the "Deploy API" button in the AWS Console and then run another `terraform plan`, Terraform detects the drift in the `deployment_id` value for the `aws_api_gateway_stage` and attempts to reconcile it with what's in the configuration. In the following plan output, `c5k6dz` is the ID of the deployment created via the `aws_api_gateway_deployment` resource, and `mfe283` is the deployment created via the AWS Console:

```console
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_stage.bug_test_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "bug_test_stage" {
      ~ deployment_id         = "mfe283" -> "c5k6dz"
        id                    = "ags-85q6cfx8d8-test"
        tags                  = {}
        # (14 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

To more accurately emulate what happens in the console, I altered the configuration that you provided to:

- Introduce a new boolean variable called `switch_deployment`
- Create a second `aws_api_gateway_deployment` resource only when `var.switch_deployment` is set to `true` 
- Change the value of the `deployment_id` argument of the `aws_api_gateway_stage` to point to the new deployment's ID when `switch_deployment` is set to `true`

<details><summary>Click to expand updated configuration</summary>

```hcl
terraform {
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "~> 5.90"
    }
  }
}

provider "aws" {
  region = "us-east-1"
}

variable "switch_deployment" {
  type    = bool
  default = false
}

resource "aws_api_gateway_rest_api" "bug_test_api" {
  name = "bug_test_api"
}

resource "aws_api_gateway_resource" "bug_test_resource" {
  rest_api_id = aws_api_gateway_rest_api.bug_test_api.id
  parent_id   = aws_api_gateway_rest_api.bug_test_api.root_resource_id
  path_part   = "test"
}

resource "aws_api_gateway_method" "bug_test_method" {
  rest_api_id   = aws_api_gateway_rest_api.bug_test_api.id
  resource_id   = aws_api_gateway_resource.bug_test_resource.id
  http_method   = "GET"
  authorization = "NONE"
}

resource "aws_api_gateway_integration" "bug_test_integration" {
  rest_api_id = aws_api_gateway_rest_api.bug_test_api.id
  resource_id = aws_api_gateway_resource.bug_test_resource.id
  http_method = aws_api_gateway_method.bug_test_method.http_method
  # integration_http_method = "POST"
  type = "MOCK"

  lifecycle {
    create_before_destroy = true
  }
}

locals {
  deployment_trigger_value = 1
}

resource "aws_api_gateway_deployment" "bug_test_deploy" {
  rest_api_id = aws_api_gateway_rest_api.bug_test_api.id
  description = "This is an example description"
  triggers = {
    redeployment = sha1(jsonencode([
      aws_api_gateway_resource.bug_test_resource.id,
      aws_api_gateway_method.bug_test_method.id,
      aws_api_gateway_integration.bug_test_integration.id,
      tostring(local.deployment_trigger_value)
    ]))
  }

  lifecycle {
    create_before_destroy = true
  }
}

# Create a new deployment based on the switch_deployment variable
resource "aws_api_gateway_deployment" "bug_test_deploy_new" {
  count       = var.switch_deployment ? 1 : 0
  rest_api_id = aws_api_gateway_rest_api.bug_test_api.id
  description = "This is an example description"
  triggers = {
    redeployment = sha1(jsonencode([
      aws_api_gateway_resource.bug_test_resource.id,
      aws_api_gateway_method.bug_test_method.id,
      aws_api_gateway_integration.bug_test_integration.id,
      tostring(local.deployment_trigger_value)
    ]))
  }
}

resource "aws_api_gateway_stage" "bug_test_stage" {
  rest_api_id   = aws_api_gateway_rest_api.bug_test_api.id
  stage_name    = "test"
  
  # set the deployment_id based on the switch_deployment variable
  deployment_id = var.switch_deployment ? aws_api_gateway_deployment.bug_test_deploy_new[0].id : aws_api_gateway_deployment.bug_test_deploy.id
  description   = "A new description"
}
```
</details>

When using this configuration with the `switch_deployment` variable initially set to `false`, and then modifying it to `true` on the second run, the behavior in the console is identical to when you click the "Deploy API" button in the console.

<details><summary>Click to expand output from apply when setting switch_deployment to true</summary>

```console
$ terraform apply -var switch_deployment=true
aws_api_gateway_rest_api.bug_test_api: Refreshing state... [id=tx34077ypf]
aws_api_gateway_resource.bug_test_resource: Refreshing state... [id=t6qc3j]
aws_api_gateway_method.bug_test_method: Refreshing state... [id=agm-tx34077ypf-t6qc3j-GET]
aws_api_gateway_integration.bug_test_integration: Refreshing state... [id=agi-tx34077ypf-t6qc3j-GET]
aws_api_gateway_deployment.bug_test_deploy: Refreshing state... [id=6mxfvd]
aws_api_gateway_stage.bug_test_stage: Refreshing state... [id=ags-tx34077ypf-test]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_deployment.bug_test_deploy_new[0] will be created
  + resource "aws_api_gateway_deployment" "bug_test_deploy_new" {
      + created_date  = (known after apply)
      + description   = "This is an example description"
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "tx34077ypf"
      + triggers      = {
          + "redeployment" = "6c8756c3c57fd560d237289fc8462051df8292a9"
        }
    }

  # aws_api_gateway_stage.bug_test_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "bug_test_stage" {
      ~ deployment_id         = "6mxfvd" -> (known after apply)
        id                    = "ags-tx34077ypf-test"
        tags                  = {}
        # (14 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_api_gateway_deployment.bug_test_deploy_new[0]: Creating...
aws_api_gateway_deployment.bug_test_deploy_new[0]: Creation complete after 0s [id=mvj9iw]
aws_api_gateway_stage.bug_test_stage: Modifying... [id=ags-tx34077ypf-test]
aws_api_gateway_stage.bug_test_stage: Modifications complete after 1s [id=ags-tx34077ypf-test]

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.
```

</details>

Based on the above, I don't believe this is a bug with the provider, but I'll wait to hear back from you with any potentially follow up questions before we close this issue out.